src/ExchangePlans/ОбменСУРМК/ОбменСУРМК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="40f23398-3d68-4834-98ce-1fde9c2f3fdb">
  <name>ОбменСУРМК</name>
  <attributes>
    <name>ВариантНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФорматаОбмена</name>
    <comment>Версия формата обмена в формате ХХ.ХХ.ХХ.ХХ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>DefinedType.ВидЦенУРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьЗаказы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОстаткиНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыгрузкиДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <type>
      <types>DefinedType.ТорговыйОбъектУРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>УРМК</name>
    <type>
      <types>CatalogRef.УниверсальныеРабочиеМестаКассиров</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиПриНеобходимости</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКонтрагентВозврата</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКассаВозврата</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьКартыЛояльностиВРМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>DefinedType.ОрганизацияУРМК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КассыККМ</name>
    <attributes>
      <name>КассаККМ</name>
      <type>
        <types>DefinedType.КассаККМУРМК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьНастройкиВозвратаРасширенногоРежима</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>DefinedType.ОрганизацияУРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КассаВозврата</name>
      <type>
        <types>CatalogRef.Кассы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

src/Documents/КассоваяСмена/КассоваяСмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КассоваяСмена</name>
  <attributes>
    <name>ДатаПервогоНепереданногоФД</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСменыККТ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>DefinedType.КассаБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНепереданныхФД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоКассовойСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаСрочнаяЗаменаФН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеКассовойСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПамятьФНПереполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПревышеноВремяОжиданияОтветаОФД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсФНИсчерпан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКассовойСмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ФДОЗакрытииСмены</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФискальноеУстройство</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ВыемкаНаличных/ВыемкаНаличных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыемкаНаличных</name>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВКассахККМ</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваКПоступлению</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОРозничныхПродажах</name>
    <type>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПлатежногоАгента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
</mdclass:Document>

src/ExchangePlans/ОбменСУРМК/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Перем РазрешенРасширенныйРежимНастройкиОбменаУРМК;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ОбменДаннымиСервер.НадоВыполнитьОбработчикПослеЗагрузкиДанных(ЭтотОбъект, Ссылка) Тогда
		ПослеЗагрузкиДанных(Отказ);
	КонецЕсли;
	ЗарегистрироватьТорговыйОбъектКОтправкеПриНеобходимости();

	РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;

КонецПроцедуры

Процедура ПослеЗагрузкиДанных(Отказ)

	ОтложеннаяОбработкаЗакрытиеСмены();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтложеннаяОбработкаЗакрытиеСмены()

	Перем ОписаниеОшибки;
	
	#Область ТекстЗапроса
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КассоваяСмена.Ссылка КАК ПроблемныйОбъект
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ОбменСУРМК.КассыККМ КАК ОбменСУРМККассыККМ
	|		ПО КассоваяСмена.КассаККМ = ОбменСУРМККассыККМ.КассаККМ
	|ГДЕ
	|	КассоваяСмена.Проведен = ЛОЖЬ
	|	И КассоваяСмена.ПометкаУдаления = ЛОЖЬ
	|	И КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Закрыта)
	|	И ОбменСУРМККассыККМ.Ссылка = &УзелИнформационнойБазы
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Дата";
	#КонецОбласти
	
	Запрос 	= Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл	
		
		ПроблемныйОбъект 		= Выборка.ПроблемныйОбъект.ПолучитьОбъект();
		ПроблемныйОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ЕстьОшибки				= Ложь; 
		ОтчетОРозничныхПродажах = Документы.ОтчетОРозничныхПродажах.ПолучитьОтчетОРозничныхПродажахПоКассовойСмене(ПроблемныйОбъект.Ссылка);
		
		Если ОтчетОРозничныхПродажах <> Неопределено Тогда
			СформироватьДокументВыемки(ПроблемныйОбъект.КассаККМ, ОтчетОРозничныхПродажах, ЕстьОшибки, ОписаниеОшибки);
		КонецЕсли;
				
		Если ЕстьОшибки Тогда
			
			ШаблонОшибки = НСтр("ru = 'При обработке кассовой смены произошла ошибка.
		                            |Дополнительное описание:
		                            |%1'");
			
			ЗаписьЖурналаРегистрации(
				ОбменДаннымиСервер.СобытиеЖурналаРегистрацииОбменДанными(),
				УровеньЖурналаРегистрации.Ошибка,,, 
				СтрШаблон(ШаблонОшибки, ОписаниеОшибки));    
				
		КонецЕсли;
			
	КонецЦикла;

КонецПроцедуры

Функция СформироватьДокументВыемки(КассаККМ, ОтчетОРозничныхПродажах, ЕстьОшибки, ОписаниеОшибки)
	
	СуммаДокумента = РозничныеПродажиСервер.ПолучитьОстатокДенежныхСредствВКассеККМ(КассаККМ);
	
	Если СуммаДокумента > 0  Тогда
		
		ДокументВыемка = Документы.ВыемкаНаличных.СоздатьДокумент();
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("Дата", ТекущаяДатаСеанса());
		СтруктураЗаполнения.Вставить("СуммаДокумента", СуммаДокумента);
		СтруктураЗаполнения.Вставить("КассаККМ", КассаККМ);
		СтруктураЗаполнения.Вставить("ВалютаДенежныхСредств", КассаККМ.ВалютаДенежныхСредств);
		СтруктураЗаполнения.Вставить("Организация", КассаККМ.Владелец);
		СтруктураЗаполнения.Вставить("ОтчетОРозничныхПродажах", ОтчетОРозничныхПродажах);
		ДокументВыемка.Заполнить(СтруктураЗаполнения);
		
		Попытка
			ДокументВыемка.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЕстьОшибки 	   = Истина;
		КонецПопытки;
		
		Возврат ДокументВыемка.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Процедура ЗарегистрироватьТорговыйОбъектКОтправкеПриНеобходимости()
	
	Если ЗначениеЗаполнено(ТорговыйОбъект)
			И Не (Ссылка.Пустая() Или ХранитьКартыЛояльностиВРМК = Ссылка.ХранитьКартыЛояльностиВРМК) Тогда
			
		ПланыОбмена.ЗарегистрироватьИзменения(Ссылка, ТорговыйОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
